Reports/РеестрДокументовОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>РеестрДокументовОказаниеУслуг</Name>
			<Comment>Реестр документов "Оказание услуг"</Comment>
		</Properties>
	</Report>
</MetaDataObject>

Documents/ОказаниеУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОказаниеУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Покупатели</xr:Item>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойствКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_ПереченьНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборСвойств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Себестоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/РеестрДокументовОказаниеУслуг/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомандаСформироватьОтчет(Команда)
	Отчет();
КонецПроцедуры  

&НаСервере
Процедура Отчет()  

//1. Предварительный этап
	Табдок = ТабличныйДокумент; // указываем тип выходных данных
	ТабДок.Очистить (); // очищаем на случай повторной формировки
	ТабДок.ТолькоПросмотр = Истина;//даем право только на просмотр

//2. Получаем созданный ранее макет с помощью вспомогательной процедуры
	Макет = ПолучитьМакетНаСервере ("Макет") ;

//2.1. Получаем области мажета и выводим их
	ОбластьЗаголовок = Макет.ПолучитьОбласть ("ОбластьЗаголовок") ;
	Табдок.Вывести(ОбластьЗаголовок) ;

	ОбластьШапка = Макет.ПолучитьОбласть ("ОбластьШапка");
	Табдок.Вывести(ОбластьШапка) ;

 

	ОбластьДанные = Макет.ПолучитьОбласть ("ОбластьДанные") ;

//2.1.1 Получаем данные для вывода в отчет
	ЗапросДанных = Новый Запрос;

ЗапросДанных.Текст = 
 "ВЫБРАТЬ
 |	ОказаниеУслуг.Дата КАК Дата,
 |	ОказаниеУслуг.Номер КАК Номер,
 |	ОказаниеУслуг.Склад КАК Склад,
 |	ОказаниеУслуг.Водитель КАК Водитель
 |ИЗ
 |	Документ.ОказаниеУслуг КАК ОказаниеУслуг
 |
 |УПОРЯДОЧИТЬ ПО
 |	Дата,
 |	ОказаниеУслуг.Ссылка" ;    

  ВыборкаДанных=ЗапросДанных.Выполнить().Выбрать();
//2.1.2 Тут будет производится заполнение полученных данных

Пока ВыборкаДанных.Следующий() Цикл
	ОбластьДанные.Параметры.Дата = ВыборкаДанных.Дата;   
	ОбластьДанные.Параметры.Номер = ВыборкаДанных.Номер;
	ОбластьДанные.Параметры.Склад = ВыборкаДанных.Склад;
    ОбластьДанные.Параметры.Водитель = ВыборкаДанных.Водитель;    
	ТабДок.Вывести(ОбластьДанные);
КонецЦикла;

 

//3. Заключительный этап - настройка вывода табличного документа

	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.МасштабПечати = 100; // это значит что масштаб будет 100 процентов

	ТабДок.РазмерСтраницы = "A4";
	ТабДок.ТочностьПечати = ТочностьПечати.Точная;

 

КонецПроцедуры   

//Вспомогательное
&НаСервере
Функция ПолучитьМакетНаСервере(ИмяМакета)
	
	ЭО=РеквизитФормыВЗначение("Отчет");
	Макет=ЭО.ПолучитьМакет(ИмяМакета);
	Возврат Макет;
КонецФункции
